src/InformationRegisters/ОчередьЧековККТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ОчередьЧековККТ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусЧека</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусЧекаККТВОчереди</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганизацияИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СистемаНалогообложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСистемНалогообложенияККТ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТорговыйОбъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыФискальныхДокументовККТ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРасчетаДенежнымиСредствами</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДанныеЧека</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубъектПерсональныхДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КассаККМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СтатусЧекаККТВОчереди.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтатусЧекаККТВОчереди</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фискализирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фискализируется</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ПериодХраненияИсторииПлатежныхОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ПериодХраненияИсторииПлатежныхОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВсеВремя</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/ОборудованиеЧекопечатающиеУстройстваВызовСервера/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область ОчередьЧековККТ 

// Чеки в очереди на фискализацию.
//
// Параметры:
//  КассаККМ - ОпределяемыйТип.КассаБПО - Касса по которой провести фискализацию, если не указано тогда по всем.
//
// Возвращаемое значение:
//  Массив.
Функция ЧекиВОчередиНаФискализацию(КассаККМ = Неопределено) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОчередьЧековККТ.ИдентификаторЗаписи КАК ИдентификаторЗаписи,
	|	ОчередьЧековККТ.ТипДокумента КАК ТипДокумента,
	|	ОчередьЧековККТ.ТипРасчета КАК ТипРасчета,
	|	ОчередьЧековККТ.Организация КАК Организация,
	|	ОчередьЧековККТ.СтатусЧека КАК СтатусЧека,
	|	ОчередьЧековККТ.ТорговыйОбъект КАК ТорговыйОбъект,
	|	ОчередьЧековККТ.ДокументОснование КАК ДокументОснование,
	|	ОчередьЧековККТ.Сумма КАК Сумма,
	|	ОчередьЧековККТ.ДанныеЧека КАК ДанныеЧека,
	|	ОчередьЧековККТ.ТипПакетнойОперации КАК ТипПакетнойОперации,
	|	ОчередьЧековККТ.ЭквайринговыйТерминал КАК ЭквайринговыйТерминал,
	|	ОчередьЧековККТ.ПараметрыПакетнойОперации КАК ПараметрыПакетнойОперации,
	|	ОчередьЧековККТ.КассаККМ КАК КассаККМ
	|ИЗ
	|	РегистрСведений.ОчередьЧековККТ КАК ОчередьЧековККТ
	|ГДЕ
	|	&Условие
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОчередьЧековККТ.Дата УБЫВ");
	
	ТекстУсловия = "ОчередьЧековККТ.СтатусЧека = ЗНАЧЕНИЕ(Перечисление.СтатусЧекаККТВОчереди.Новый)";
	Если ЗначениеЗаполнено(КассаККМ) Тогда
		ТекстУсловия = ТекстУсловия + " И ОчередьЧековККТ.КассаККМ = &КассаККМ";
		Запрос.УстановитьПараметр("КассаККМ", КассаККМ);
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Условие", ТекстУсловия);
	
	ЧекиНаФискализацию = Новый Массив();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДанныеЧека = Новый Структура;
		ДанныеЧека.Вставить("ИдентификаторЗаписи");
		ДанныеЧека.Вставить("ТипДокумента");
		ДанныеЧека.Вставить("ТипРасчета");
		ДанныеЧека.Вставить("СтатусЧека");
		ДанныеЧека.Вставить("Организация");
		ДанныеЧека.Вставить("ТорговыйОбъект");
		ДанныеЧека.Вставить("Сумма");
		ДанныеЧека.Вставить("ДокументОснование");
		ДанныеЧека.Вставить("ТипПакетнойОперации");
		ДанныеЧека.Вставить("ЭквайринговыйТерминал");
		ДанныеЧека.Вставить("КассаККМ");
		ДанныеЧека.Вставить("ДанныеЧека", Новый Структура());
		ДанныеЧека.Вставить("ПараметрыПакетнойОперации", Новый Структура());
		
		ЗаполнитьЗначенияСвойств(ДанныеЧека, Выборка);
		
		ХранилищеДанныеЧека = ДанныеЧека.ДанныеЧека;
		Если ТипЗнч(ХранилищеДанныеЧека) = Тип("ХранилищеЗначения") Тогда
			ДанныеЧека.ДанныеЧека = ХранилищеДанныеЧека.Получить();
		КонецЕсли;
		
		ХранилищеПараметрыПакетнойОперации = ДанныеЧека.ПараметрыПакетнойОперации;
		Если ТипЗнч(ХранилищеПараметрыПакетнойОперации) = Тип("ХранилищеЗначения") Тогда
			ДанныеЧека.ПараметрыПакетнойОперации = ХранилищеПараметрыПакетнойОперации.Получить();
		КонецЕсли;
		
		ЧекиНаФискализацию.Добавить(ДанныеЧека);
	КонецЦикла;
	
	Возврат ЧекиНаФискализацию;
	
КонецФункции

#КонецОбласти

#Область ФормированиеДанныхККТ

// Возвращает для каких типов товаров будет заполняться отраслевой реквизит.
//
// Возвращаемое значение:
//   Структура: 
//  * ИзделияИзНатуральногоМеха - Булево - Заполнения для изделия из натурального меха. 
//  * ОбъемноСортовойУчет - Булево - Заполнения для товаров объемно сортового учета.
//  * МолочнаяПродукцияСНечитаемымиКМ - Булево - Заполнения для молочной продукция с нечитаемыми КМ.
//
Функция ТипыТоваровДляЗаполненияОтраслевогоРеквизита() Экспорт;
	
	ТипыТоваров = Новый Структура();
	ТипыТоваров.Вставить("ИзделияИзНатуральногоМеха", Ложь);
	ТипыТоваров.Вставить("ОбъемноСортовойУчет", Ложь);
	ТипыТоваров.Вставить("МолочнаяПродукцияСНечитаемымиКМ", Ложь);
	Возврат ТипыТоваров;
	
КонецФункции   

// Возвращает для каких типов товаров будет заполняться отраслевой реквизит.
//
// Возвращаемое значение:
//   Структура - см.ТипыТоваровДляЗаполненияОтраслевогоРеквизита()  
//
Функция ОтраслевойРеквизитЗаполняетсяДляТиповТоваров() Экспорт
	
	ТипыТоваров = ТипыТоваровДляЗаполненияОтраслевогоРеквизита();
	МенеджерОборудованияВызовСервераПереопределяемый.ОтраслевойРеквизитЗаполняетсяДляТиповТоваров(ТипыТоваров);
	Возврат ТипыТоваров;
	
КонецФункции


// Возвращает ведется объемно сортовой учет.
//
// Возвращаемое значение:
//  Булево.
//           
Функция ВедетсяОбъемноСортовойУчет() Экспорт
	
	Результат = Ложь;
	ОбъемноСортовойУчет = Результат; 
	СтандартнаяОбработка = Истина;
	МенеджерОборудованияВызовСервераПереопределяемый.ВедетсяОбъемноСортовойУчет(ОбъемноСортовойУчет, СтандартнаяОбработка);
	Результат = ?(СтандартнаяОбработка, Результат, ОбъемноСортовойУчет);
	Возврат Результат; 
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Возвращает период хранения платежных операций в регистре сведений
//
// Возвращаемое значение:
//   ПериодХранения - ПеречислениеСсылка.ПериодХраненияИсторииПлатежныхОпераций
Функция ПериодХраненияИсторииОперацийОчередиЧеков() Экспорт
	
	ПериодХранения = Константы.СрокХраненияОперацийОчередиЧеков.Получить();
	Возврат ПериодХранения;
	
КонецФункции

// Возвращает период хранения платежных операций в регистре сведений
//
// Возвращаемое значение:
//   ПериодХранения - ПеречислениеСсылка.ПериодХраненияИсторииПлатежныхОпераций
Функция ПериодХраненияИсторииФискальныхОпераций() Экспорт
	
	ПериодХранения = Константы.СрокХраненияФискальныхОпераций.Получить();
	Возврат ПериодХранения;
	
КонецФункции

// Установить значение констант сроков хранения операций в регистрах сведений
//
Процедура УстановитьСрокХраненияОперацийОчередиЧеков() Экспорт 
	
	Если НЕ ЗначениеЗаполнено(Константы.СрокХраненияОперацийОчередиЧеков.Получить()) Тогда
		Константы.СрокХраненияОперацийОчередиЧеков.Установить(Перечисления.ПериодХраненияИсторииПлатежныхОпераций.ВсеВремя);
	КонецЕсли;
	
КонецПроцедуры

// Установить значение констант сроков хранения операций в регистрах сведений
//
Процедура УстановитьСрокХраненияФискальныхОпераций() Экспорт 
	
	Если НЕ ЗначениеЗаполнено(Константы.СрокХраненияФискальныхОпераций.Получить()) Тогда
		Константы.СрокХраненияФискальныхОпераций.Установить(Перечисления.ПериодХраненияИсторииПлатежныхОпераций.ВсеВремя);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

 #Область СлужебныеПроцедурыИФункции

 #Область ФормированиеДанныхККТ

// Данные запроса проверки кода для разрешительной системы
//
Процедура ЗаполнитьДанныеЗапросПроверкиКода(Позиция)
	
	ЗапросПроверкиКода = Позиция.ЗапросПроверкиКода; 
	ОтраслевойРеквизит = Позиция.ОтраслевойРеквизит;
	
	Если Не ПустаяСтрока(ЗапросПроверкиКода.ИдентификаторЗапроса) И Не ПустаяСтрока(ЗапросПроверкиКода.ВременнаяМетка) Тогда
		ОтраслевойРеквизит.ИдентификаторФОИВ = "030"; // 1262 - "030"
		ОтраслевойРеквизит.ДатаДокументаОснования = Дата("20231121"); // 1263 - "21.11.2023"
		ОтраслевойРеквизит.НомерДокументаОснования = "1944"; // 1264 - "1944"
		ЗначениеРеквизита = "UUID=%1&Time=%2";             
		ЗначениеРеквизита = СтрШаблон(ЗначениеРеквизита, ЗапросПроверкиКода.ИдентификаторЗапроса, ЗапросПроверкиКода.ВременнаяМетка); 
		ОтраслевойРеквизит.ЗначениеРеквизита = ЗначениеРеквизита;  // 1265  
	КонецЕсли;
	
КонецПроцедуры 

Процедура ЗаполнитьОтраслевойРеквизитМолочнаяПродукцияСНечитаемымиКМ(Позиция) Экспорт
	
	ТипыТоваров = ОтраслевойРеквизитЗаполняетсяДляТиповТоваров();
	ОтраслевойРеквизит = Позиция.ОтраслевойРеквизит;
	Если ТипыТоваров.МолочнаяПродукцияСНечитаемымиКМ Тогда   
		ДатаПроизводства = ?(Позиция.ДатаПроизводства <> Неопределено, Формат(Позиция.ДатаПроизводства, "ДФ=""ггММдд"""), "");
		ОтраслевойРеквизит.ИдентификаторФОИВ = "030"; // 1262 
		ОтраслевойРеквизит.ДатаДокументаОснования = Дата("20201215"); // 1263
		ОтраслевойРеквизит.НомерДокументаОснования = "2099"; // 1264
		ОтраслевойРеквизит.ЗначениеРеквизита = "pd=" + ДатаПроизводства + "&km=tech"; // 1265 - ГГММДД – дата производства товара
	КонецЕсли; 
	
КонецПроцедуры 

#КонецОбласти

#Область Служебные

// Преобразовать в булево возможные значения строки
Функция ПреобразоватьВБулево(Строка)
	Попытка
		Возврат XMLЗначение(Тип("Булево"), Строка);
	Исключение
		Возврат ВРег(Строка) = "ДА" Или ВРег(Строка) = "TRUE" Или ВРег(Строка) = "YES";
	КонецПопытки;
КонецФункции

#КонецОбласти

#КонецОбласти
